Tekla.Structures.Catalogs.ProfileItemSubType
The Tekla.Structures.Catalogs.ProfileItemSubType class contains the information of one profile item sub type
(id, label, parameter string and bitmap name). A profile item can contain a maximum
of 10 profile item sub types.

Tekla.Structures.Catalogs.ProfileItemSubType.SubTypeId
Gets a value of the property Tekla.Structures.Catalogs.ProfileItemSubType.SubTypeId.

Tekla.Structures.Catalogs.ProfileItemSubType.Label
Gets a value of the property Tekla.Structures.Catalogs.ProfileItemSubType.Label.

Tekla.Structures.Catalogs.ProfileItemSubType.ParameterString
Gets a value of the property Tekla.Structures.Catalogs.ProfileItemSubType.ParameterString.

Tekla.Structures.Catalogs.ProfileItemSubType.BitmapName
Gets a value of the property Tekla.Structures.Catalogs.ProfileItemSubType.BitmapName.

Tekla.Structures.Catalogs.ProfileItemSubType.From(System.Int32,System.String,System.String,System.String)
Fill the data from the stuct data.
subTypeId: The sub type id.
label: The label.
parameterString: The parameter string.
bitmap: The bitmap.